---
kind: property
id: P:Autodesk.Revit.DB.ColumnAttachment.TargetId
source: html/48072fb6-5cbc-e071-c0f8-fb862320ec28.htm
---
# Autodesk.Revit.DB.ColumnAttachment.TargetId Property

The id of the element that is attached to the column and is described by this ColumnAttachment.

## Syntax (C#)
```csharp
public ElementId TargetId { get; }
```